# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv5 object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/yolov5

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov5n.yaml' will call yolov5.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 1024]
  l: [1.00, 1.00, 1024]
  x: [1.33, 1.25, 1024]

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, shuffle_SE_2, [128]],  # 1-P2/4
   [-1, 3, shuffle_SE_1, [128]],
   [-1, 1, shuffle_SE_2, [256]],  # 3-P3/8
   [-1, 6, shuffle_SE_1, [256]],
   [-1, 1, shuffle_SE_2, [512]],  # 5-P4/16
   [-1, 9, shuffle_SE_1, [512]],
   [-1, 1, shuffle_SE_2, [1024]],  # 7-P5/32
   [-1, 3, shuffle_SE_1, [1024]],
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, DWConvBlock, [512]],  # 12

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, DWConvBlock, [256]],  # 16 (P3/8-small)

   [-1, 1, DWConvBlock, [256, 2]],
   [[-1, 13], 1, ADD, [1]],  # cat head P4
   [-1, 3, DWConvBlock, [512]],  # 19 (P4/16-medium)

   [-1, 1, DWConvBlock, [512, 2]],
   [[-1, 9], 1, ADD, [1]],  # cat head P5
   [-1, 3, DWConvBlock, [1024]],  # 22 (P5/32-large)

   [[16, 19, 22], 1, Detect, [nc]],  # Detect(P3, P4, P5)
  ]
